#Chapter01
def Chaper01Text(name, tem):
    txt = ["지나치게 화창한 올해 여름.", f"오늘의 날씨는 무려 <{tem}도>(화씨임). 엄청난 폭염이다...", f"무더운 여름을 나기 위해 {name}(은/는) 친구들과 내일 워터파크에 놀러가기로 했다.", "그들 앞에 다가올 엄청난 운명을 예측하지 못한 채..."]
    return txt
##그런데 이거랑 밑에 Chapter02랑 원래 쓰던 방식이랑 다른 점이 뭔지 정확하게 모르겠어

#Chapter02
def Chapter02Text1(name, tem):
    txt = [f"{tem + 1.0}도의 폭염을 이겨내고, 워터파크에 도착한 우리들.", f"{name}(은/는) 수영복으로 갈아입고 깨끗하게 샤워를 했다.", "(오늘을 위해 다이어트를 했지. 귀엽고 섹시한 내 모습을 뽐내볼까..!)", f"파도 풀로 힘찬 걸음을 옮기는 {name}.", "그런데..!", "[으앗..!] / [꺅...!!]", "(강한 통증과 함께 어렴풋이 부드러운 살결이 느껴졌다.)", "(크아아악 아파라..) [저기... 괜찮으세요?]", "[지금 눈을 어디다 두고 다니시는 거예욧!!!]", "[???]", "[????????]", "(분명 나는 잘 걷고 있었는데... 내가 잘못했다는 건가? 적반하장도 가분수지.)"]
    return txt

def Chapter02Text2(name, gender):
    other_gender = "여자" if gender == True else "남자"
    txt = [f"그 후 {name}(은/는) 허둥지둥 친구들과 합류했다.", "[뭐야 왜이렇게 늦었어. 또 똥 싸고 왔냐?]", "[아니야... 오다가 어떤 재수 없는 돌대가리랑 부딪혀가지고. 아이고 아직도 아프네]", "[ㅋㅋㅋ 너도 한 돌대가리 하잖아]", "[ㅋㅋ 조용히 해. 그나저나 아까 부딪힌 사람...]", "친구들한테 방금까지 무슨일이 있었는지 설명했다." f"아까 나오다가 어떤 {other_gender}랑 부딪혔는데"]
    return txt
## 이렇게도 쓸 수 있음??

sample = """친구들의 다양한 반응도 잠시, {name}과 친구들은 시간 가는줄 모르고 워터파크에서 즐기기 시작했다.
파도풀을 시작으로 여러가지 기구들을 미친듯이 타고, 유수풀에서 서로 물멕이기를 하다보니 꼭대기에 있던 해가 사라지려 하고 있었다.
시간가는줄 모르고 놀던 우리는 슬슬 워터파크에서 나가기 위해서 이동중이었다. 그러다 앞에서 익숙한 실루엣이 보이는데...
그 실루엣과 눈이 마주쳤다.

--만남--
[엇? 너는 아까 그 왕재수/왕싸가지?]
    a. [왕재수/왕싸가지? 본인이 잘못했으면서 뒤지고 싶어요?]
    b. [어 뭐야 아까 왕재수/왕싸가지를 또 만나네요?]
    c. [???]

[뭐 어쨌든 아까는 미안했어요]
[흥 사과하니까 그냥 넘어가는거에요]
[다친데는 없어요?]
[네 다행히 어디 아프고 그러지는 않네요]
처음에는 날카로운 신경전이 있었지만 서로 약간의 대화를 나누게 되면서 분위기가 약간 풀렸다.
아까는 몰랐지만 그/그녀와 대화를 나누게 되면서 얼굴을 자세히 보게되었는데, 상당히 내 취향의 얼굴이었다.
대화도 나눠보니 생각보다는 왕재수/왕싸가지는 아닌거 같고, 얼굴도 내 스타일이니 그냥 지나가기에는 조금 아쉽다.

[우리 이렇게 된것도 인연인데]
    a. 번호 교환이나 할까요?
    b. 같이 밥이나 언제 할까요? 제가 살게요
    c. 몸의 대화를 한번 해볼까요?


"""

#Chapter03
