#Chapter01
def Chaper01Text(name, tem):
    txt = ["지나치게 화창한 올해 여름.", f"오늘의 날씨는 무려 <{tem}도>(화씨임). 엄청난 폭염이다...", f"무더운 여름을 나기 위해 {name}(은/는) 친구들과 내일 워터파크에 놀러가기로 했다.", "그들 앞에 다가올 엄청난 운명을 예측하지 못한 채..."]
    return txt

#Chapter02
def Chapter02Text1(name, tem):
    txt = [f"{tem + 1.0}도의 폭염을 이겨내고, 워터파크에 도착한 우리들.", f"{name}(은/는) 수영복으로 갈아입고 깨끗하게 샤워를 했다.", "(오늘을 위해 다이어트를 했지. 귀엽고 섹시한 내 모습을 뽐내볼까..!)", f"파도 풀로 힘찬 걸음을 옮기는 {name}.", "그런데..!", "[으앗..!] / [꺅...!!]", "(강한 통증과 함께 어렴풋이 부드러운 살결이 느껴졌다.)", "(크아아악 아파라..) [저기... 괜찮으세요?]", "[지금 눈을 어디다 두고 다니시는 거예욧!!!]", "[???]", "[????????]", "(분명 나는 잘 걷고 있었는데... 내가 잘못했다는 건가? 적반하장도 가분수지.)"]
    return txt

def Chapter02Text2(name):
    txt = [f"그 후 {name}(은/는) 허둥지둥 친구들과 합류했다.", "[뭐야 왜이렇게 늦었어. 또 똥 싸고 왔냐?]", "[아니야... 오다가 어떤 재수 없는 돌대가리랑 부딪혀가지고. 아이고 아직도 아프네]", "[ㅋㅋㅋ 너도 한 돌대가리 하잖아]"]
    return txt

#Chapter03
